minida28/ISLAMIC-PRAYTIMES-ESP8266-OLED-SH1106/src/asyncserver.cpp
  //  sholattimeevent.onConnect([](AsyncEventSourceClient * client) {
  //    //client->send("hello!", NULL, millis(), 1000);
  //    //_secondTk.attach(1.0f, s_secondTick, static_cast<void*>(client)); // Task to run periodic things every second
  //  });
  //  server.addHandler(&sholattimeevent);

  server.addHandler(new SPIFFSEditor());

  server.on("/list", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);
    handleFileList(request);
  });

  // server.on("/description.xml", [](AsyncWebServerRequest *request) {
  //   DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);
  //   // SSDP.schema(HTTP.client());
  // });

  server.on("/description.xml", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

    File file = SPIFFS.open(FPSTR(pgm_descriptionxmlfile), "r");
    if (!file)
    {
      PRINT("Failed to open config file\r\n");
      return;
    }

    size_t size = file.size();
    PRINT("DESCRIPTION_XML_FILE file size: %d bytes\r\n", size);
    if (size > 1024)
    {
      PRINT("WARNING, file size maybe too large\r\n");
    }

    // Allocate a buffer to store contents of the file
    char buf[size];

    //copy file to buffer
    file.readBytes(buf, size);

    //add termination character at the end
    buf[size] = '\0';

    //close the file, save your memory, keep healthy :-)
    file.close();

    PRINT("%s\r\n", buf);

    StreamString output;

    if (output.reserve(1024))
    {
      //convert IP address to char array
      size_t len = strlen(WiFi.localIP().toString().c_str());
      char URLBase[len + 1];
      strlcpy(URLBase, WiFi.localIP().toString().c_str(), sizeof(URLBase));

      // const char *friendlyName = WiFi.hostname().toString().c_str();
      len = strlen(WiFi.hostname().c_str());
      char friendlyName[len + 1];
      strlcpy(friendlyName, WiFi.hostname().c_str(), sizeof(friendlyName));

      char presentationURL[] = "/";
      uint32_t serialNumber = ESP.getChipId();
      char modelName[] = "LS-01";
      const char *modelNumber = friendlyName;
      //output.printf(ssdpTemplate,
      output.printf(buf,
                    URLBase,
                    friendlyName,
                    presentationURL,
                    serialNumber,
                    modelName,
                    modelNumber, //modelNumber
                    (uint8_t)((serialNumber >> 16) & 0xff),
                    (uint8_t)((serialNumber >> 8) & 0xff),
                    (uint8_t)serialNumber & 0xff);
      request->send(200, "text/xml", output);
    }
    else
    {
      request->send(500);
    }
  });

  // SSDP.schema(HTTP.client());

  server.serveStatic("/", SPIFFS, "/").setDefaultFile("index.htm");

  server.onNotFound([](AsyncWebServerRequest *request) {
    DEBUGLOG("NOT_FOUND: ");
    if (request->method() == HTTP_GET)
    {
      DEBUGLOG("GET");
    }
    else if (request->method() == HTTP_POST)
    {
      DEBUGLOG("POST");
    }
    else if (request->method() == HTTP_DELETE)
    {
      DEBUGLOG("DELETE");
    }
    else if (request->method() == HTTP_PUT)
    {
      DEBUGLOG("PUT");
    }
    else if (request->method() == HTTP_PATCH)
    {
      DEBUGLOG("PATCH");
    }
    else if (request->method() == HTTP_HEAD)
    {
      DEBUGLOG("HEAD");
    }
    else if (request->method() == HTTP_OPTIONS)
    {
      DEBUGLOG("OPTIONS");
    }
    else
    {
      DEBUGLOG("UNKNOWN");
    }
    DEBUGLOG("http://%s%s\r\n", request->host().c_str(), request->url().c_str());

    if (request->contentLength())
    {
      DEBUGLOG("_CONTENT_TYPE: %s\r\n", request->contentType().c_str());
      DEBUGLOG("_CONTENT_LENGTH: %u\r\n", request->contentLength());
    }

    int headers = request->headers();
    int i;
    for (i = 0; i < headers; i++)
    {
      AsyncWebHeader *h = request->getHeader(i);
      DEBUGASYNCWS("_HEADER[%s]: %s\r\n", h->name().c_str(), h->value().c_str());
    }

    int params = request->params();
    for (i = 0; i < params; i++)
    {
      AsyncWebParameter *p = request->getParam(i);
      if (p->isFile())
      {
        DEBUGLOG("_FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
      }
      else if (p->isPost())
      {
        DEBUGLOG("_POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
      }
      else
      {
        DEBUGLOG("_GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
      }
    }

    request->send(404);
  });
  server.onFileUpload([](AsyncWebServerRequest *request, const String &filename, size_t index, uint8_t *data, size_t len, bool final) {
    if (!index)
      DEBUGLOG("UploadStart: %s\r\n", filename.c_str());
    DEBUGLOG("%s", (const char *)data);
    if (final)
      DEBUGLOG("UploadEnd: %s (%u)\r\n", filename.c_str(), index + len);
  });
  server.onRequestBody([](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
    if (!index)
      DEBUGLOG("BodyStart: %u\r\n", total);
    DEBUGLOG("%s", (const char *)data);
    if (index + len == total)
      DEBUGLOG("BodyEnd: %u\r\n", total);
  });

  server.on("/scan", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());

    AsyncResponseStream *response = request->beginResponseStream("application/json");
    DynamicJsonBuffer jsonBuffer;
    JsonArray &root = jsonBuffer.createArray();

    int numberOfNetworks = WiFi.scanComplete();
    if (numberOfNetworks == -2)
    {                          //this may also works: WiFi.scanComplete() == WIFI_SCAN_FAILED
      WiFi.scanNetworks(true); //async enabled
    }
    else if (numberOfNetworks)
    {
      for (int i = 0; i < numberOfNetworks; ++i)
      {
        JsonObject &wifi = root.createNestedObject();
        wifi["ssid"] = WiFi.SSID(i);
        wifi["rssi"] = WiFi.RSSI(i);
        wifi["bssid"] = WiFi.BSSIDstr(i);
        wifi["channel"] = WiFi.channel(i);
        wifi["secure"] = WiFi.encryptionType(i);
        wifi["hidden"] = WiFi.isHidden(i) ? true : false;
      }
      WiFi.scanDelete();
      if (WiFi.scanComplete() == -2)
      { //this may also works: WiFi.scanComplete() == WIFI_SCAN_FAILED
        WiFi.scanNetworks(true);
      }
    }
    root.printTo(*response);
    request->send(response);
  });

  server.on("/admin/restart", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    restart_esp(request);
  });

  server.on("/reset", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());
    reset_esp(request);
  });

